//TODO:===================================
// У змінній min лежить число від 0 до 59. Визначте у котру чверть години
// Попадає це число (у першу, другу, третю або четверту).

// let min = 30;
// if (min <= 15) {
//   console.log("1а чверть");
// } else if (15 <= min && min <= 30) {
//   console.log("2а чверть");
// } else if (30 <= min && min <= 45) {
//   console.log("3а чверть");
// } else {
//   console.log("4а чверть");
// }

// Використовуючи функцію if...else,
// напишіть код, який запитуватиме:
// "Яка офіційна назва JavaScript?"
// Якщо користувач вводить "ECMAScript",
// то показати через alert: "Вірно!"
// інакше відобразити:"Не знаєте? ECMAScript!"

// let string = prompt("Яка офіційна назва JavaScript?");

// if (string === "ECMAScript") {
//   alert("Вірно!");
// } else {
//   alert("Не знаєте? ECMAScript!");
// }

// Напишіть програму, яка отримає від користувача
//число (кількість хвилин) і виведе у консоль
//Рядок у форматі годин і хвилин
// 70 === 01:10
// https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/String/padStart

// let minutes = Number(prompt("Enter minutes to format"));
// let hours = Math.floor(minutes / 60);
// let minuteFormat = minutes - hours * 60;
// minuteFormat = String(minuteFormat).padStart(2, "0");
// hours = String(hours).padStart(2, "0");
// alert(`${hours}:${minuteFormat}`);


// Напишіть цикл, який виводить у консоль числа від max до min за спаданням
//  Виведіть у консоль  усіх парних чисел від min до max


// const max = 50;
// const min = 23;

// // часть 1

// for (let i = max; i >= min; i -= 1) {
//     // console.log(i);
//     if (i % 2 === 0) {
//         console.log(`Четное:`, i);
//     }
// }
//_____________________________________

// Напишіть код, який запитуватиме
// Логін за допомогою prompt і логувати результат
// В консоль браузера

// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль.
// Якщо нічого не ввели або натиснута клавіша Esc
// Вивести рядок "Скасовано"
//  Інакше вивести рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "Я головний", то вивести рядок "Здрастуйте!"
// інакше виводити рядок "Невірний пароль!"

// const login = prompt("Логін");

// console.log(login);

// if (login === "Админ") {
//     let password = prompt("Пароль");
//     if (!password) { console.log("Скасовано"); }
//     else {
//         switch (password) {
//             case "Я головний": {
//                 console.log("Здрастуйте!");
//                 break;
//             }
//             default: {
//                 console.log("Невірний пароль!");
//             }
//         }
//      }
// } else {
//     console.log("Я вас не знаю");
// }
// const login = prompt("Логін");

// console.log(login);
// if (login === "Админ") {
//     let password = prompt("Пароль");
//     if (!password) { console.log("Скасовано"); }
//     else {
//         console.log(password === "Я головний" ? "Здрастуйте!" : "Невірний пароль!");
//     }
     
// } else {
//     console.log("Я вас не знаю");
// }
//______________________________________________


// При завантаженні сторінки користувачеві пропонується
// В prompt ввести число. Введення додається до значення
// Змінної total.
// Операція введення числа триває до того часу,
// Поки користувач не натисне кнопку Cancel в prompt.
// Після того, як користувач припинив введення натиснувши накнопку Cancel, показати alert з рядком "Загальна сума введених чисел дорівнює [число]."
// Робити перевірку,що користувач ввів саме число, а не довільний набір символів не потрібно.

// let total = 0;
// let number = Number(prompt("Введи число", 0));

// do {
//     total += number;
//     number = Number(prompt("Введи число", 0));
// } while (number);

// alert(`Загальна сума введених чисел дорівнює ${total}`);


// Напишіть цикл, який пропонує ввести число більше 100 через prompt.
// Якщо відвідувач ввів інше число - попросити
// Ввести ще раз і так далі.
// Цикл повинен запитувати число, поки відвідувач не введе число більше 100, або натисне кнопку
// Скасування в prompt


// let ourNumber;

// do {
//     ourNumber = Number(prompt("Введи число"));
//      }
// } while (ourNumber < 100)

// let ourNumber = Number(prompt("Введи число"));

// while (ourNumber < 100){
//     ourNumber = Number(prompt("Введи число"));
   
// }